Tekla.Structures.Dialog.UIControls.WpfSteelFinishComboBox
The WpfSteelFinishComboBox class represents a control to select the steel finish from the list.

Tekla.Structures.Dialog.UIControls.WpfSteelFinishComboBox.finishes
Steel finishes list.

Tekla.Structures.Dialog.UIControls.WpfSteelFinishComboBox.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.WpfSteelFinishComboBox.FinishProperty
A dependency property that represents the finish value.

Tekla.Structures.Dialog.UIControls.WpfSteelFinishComboBox.Finish
Gets or sets the finish value

Tekla.Structures.Dialog.UIControls.WpfSteelFinishComboBox.InitializeFinishList
Load finish list.

Tekla.Structures.Dialog.UIControls.WpfSteelFinishComboBox.ComboBox_TextChanged(System.Object,System.Windows.Controls.TextChangedEventArgs)
Event handler for TextChanged event.
sender: The sender.
e: The event arguments.